In [2]:
import pandas as pd

# Main dataframe to collect all data
table_from_html = pd.read_html("https://www.payscale.com/college-salary-report/majors-that-pay-you-back/bachelors")
df = table_from_html[0].copy()
df.columns = ["Rank", "Major", "Type", "EarlyCareerPay", "MidCareerPay", "HighMeaning"]
 
# Add tables from other pages to main dataframe
for page_no in range(2, 35):
    table_from_html = pd.read_html(f"https://www.payscale.com/college-salary-report/majors-that-pay-you-back/bachelors/page/{page_no}")
    page_df = table_from_html[0].copy()
    page_df.columns = ["Rank", "Major", "Type", "EarlyCareerPay", "MidCareerPay", "HighMeaning"]
    df = df.append(page_df, ignore_index=True)
 
# Select necessary columns only
df = df[["Major", "EarlyCareerPay", "MidCareerPay"]]
 
# Clean columns
df.replace({"^Major:": "", "^Early Career Pay:\$": "", "^Mid-Career Pay:\$": "", ",": ""}, regex=True, inplace=True)
 
# Change datatype of numeric columns
df[["EarlyCareerPay", "MidCareerPay"]] = df[["EarlyCareerPay", "MidCareerPay"]].apply(pd.to_numeric)

In [3]:
df.nlargest(5, "EarlyCareerPay")

,Major,EarlyCareerPay,MidCareerPay
1,Electrical Engineering & Computer Science (EECS),101200,152300
74,Physician Assistant Studies,92900,112200
0,Petroleum Engineering,92300,182000
49,Metallurgical Engineering,79100,117700
3,Operations Research,78400,139600

In [4]:
df.nlargest(5, "MidCareerPay")

,Major,EarlyCareerPay,MidCareerPay
0,Petroleum Engineering,92300,182000
1,Electrical Engineering & Computer Science (EECS),101200,152300
2,Applied Economics and Management,60900,139600
3,Operations Research,78400,139600
4,Public Accounting,60000,138800

In [5]:
df.tail()

                         Major  EarlyCareerPay  MidCareerPay
829  Early Childhood Education           34100         43300
830              Mental Health           35200         42500
831          Medical Assisting           35100         42300
832      Addictions Counseling           38800         42200
833              Metalsmithing           38300         38400

In [8]:
pd.options.display.float_format = '{:,.2f}'.format 
df.groupby('Major').mean()

                                   EarlyCareerPay  MidCareerPay
Major
3D Animation                                49400         72500
Accounting                                  51700         88700
Accounting & Auditing                       55400         95700
Accounting & Business                       49400         77600
Accounting & Computer Systems               60200        103800
...                                           ...           ...
Women's Studies                             42700         65400
Workforce Education & Development           57100         79000
Writing                                     41800         77000
Youth Ministry                              35300         52300
Zoology                                     40300         74600

[834 rows x 2 columns]

In [28]:
pd.options.display.float_format = '{:20,.2f}'.format 
print(f"This is the amount: ${'{:2,.2f}'.format(df['EarlyCareerPay'].max())} and this is the id: {df['EarlyCareerPay'].idxmax()}")

This is the amount: $101,200.00 and this is the id: 1

In [16]:
df['Major'][1]

'Electrical Engineering & Computer Science (EECS)'